app/views/taches/_contacts.html.erb

    <!-- on affiche les données initiales -->
    <%= collection_select :tache, :contact_id, Contact.where(:compte_id => @tache.compte.id).order(:nom), :id, :nom_complet, {:include_blank => true}, :remote=>true%>
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."compte_id" = 5 ORDER BY nom

    <!-- sinon on affiche des blancs -->
    <%= collection_select  :tache, :contact_id, Contact.where(:compte_id => 0), :id, :nom_complet, {:include_blank => true}, :remote=>true %>
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."compte_id" = 0