app/views/taches/_filter.html.erb

      <div class="span2">
        <h6>Collaborateur : </h6><%= f.collection_select :user_email, User.order('email ASC').all, :email, :nom_complet, {:include_blank => "Tous"} , :class =>"filter_coll"%>
---
SELECT "users".* FROM "users" ORDER BY email ASC