app/views/taches/_form.html.erb

SELECT "users".* FROM "users"
---
  <div class="field">
    <div class="span2"> Affectée à : </div> <%= f.collection_select :user_id, User.all, :id, :nom_complet %> <%= check_box_tag :mail, "yes"%> Envoyer un email à ce collaborateur

SELECT "types".* FROM "types" ORDER BY libelle
---

  <div id="tache_values" style="display: none;">
  <div class="row">
    <div class="span12">
      Type de l'évènement : <br /> <%= collection_select :type, :id ,Type.order('libelle'),:id, :type_complet, {:style =>"width: 100%"}%>