app/views/comptes/_form.html.erb

  <div class="field">
    <div class="span2"> Utilisateur : </div> <%= f.collection_select :user_id, User.all, :id, :nom_complet %>
---
SELECT "users".* FROM "users"