app/views/comptes/_modal_produits.html.erb

SELECT "produits".* FROM "produits" ORDER BY nom ASC
---
  <h4>Produit(s) disponible(s) :</h4>
  <% @produits = Produit.order('nom ASC').all %>

SELECT "produits".* FROM "produits" INNER JOIN "comptes_produits" ON "produits"."id" = "comptes_produits"."produit_id" WHERE "comptes_produits"."compte_id" IS NULL ORDER BY nom ASC
---
    <h4>Produit(s) associé(s) :</h4>
    <%= select_tag :compte_produit, options_from_collection_for_select(@compte.produits.order('nom ASC').all, "id", "nom"), {:size => 6, :multiple => true} %>