app/controllers/comptes_controller.rb

SELECT "comptes".* FROM "comptes" ORDER BY societe LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "comptes"
---
  def index

    @comptes = Compte.order("societe").page(params[:page])