app/controllers/taches_controller.rb

  def index
    @page = params[:page]
    @taches = Tache.where("user_id =? AND statut IN ('En cours','A faire')", current_user).order("statut ASC ,echeance ASC").page(@page)

    #infos typeahead
    @autocomplete_comptes = Compte.find(:all,:select=>'societe').map(&:societe)
    @autocomplete_contacts = Contact.find(:all,:select=>'nom').map(&:nom)
---
SELECT "comptes".* FROM "comptes" WHERE "comptes"."id" = 5 LIMIT 1
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = 28 LIMIT 1

  def create
    @tache = Tache.new(params[:tache])
    @tache.created_by = current_user.nom_complet
---
INSERT INTO "taches" ("compte_id", "contact_id", "created_at", "created_by", "echeance", "fichier_joint_content_type", "fichier_joint_file_name", "fichier_joint_file_size", "fichier_joint_updated_at", "modified_at", "modified_by", "notes", "statut", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def destroy
    @tache = Tache.find(params[:id])
    @tache.destroy
---
DELETE FROM "taches" WHERE "taches"."id" = $1  [["id", 97]]

  def update_contact_select
    contacts = Contact.where(:compte_id => params[:id]).order(:nom)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."compte_id" = 5 ORDER BY nom